import * as React from "react";
import Dialog from "@mui/material/Dialog";
import DialogActions from "@mui/material/DialogActions";
import DialogContent from "@mui/material/DialogContent";
import DialogTitle from "@mui/material/DialogTitle";
import { useDispatch, useSelector } from "react-redux";
import { AppDispatch, RootState } from "../../../redux/store";
import { setOpenReducer } from "../../../redux/openInfoReducer/openInfoReducer";
import CloseIcon from "@mui/icons-material/Close";
import IconButton from "@mui/material/IconButton";
import Tooltip from "@mui/material/Tooltip";

const ScrollDialog: React.FC = () => {
  const openWindow = useSelector((state: RootState) => state.openInfo.data);
  const dispatchStore = useDispatch<AppDispatch>();
  const handleClose = () => dispatchStore(setOpenReducer(false, ""));

  return (
    <React.Fragment>
      <Dialog
        open={openWindow}
        onClose={handleClose}
        aria-labelledby="scroll-dialog-title"
        aria-describedby="scroll-dialog-description"
      >
        <div
          style={{
            display: "flex",
            justifyContent: "space-between",
            alignItems: "center",
          }}
        >
          <DialogTitle id="scroll-dialog-title">
            Информация о проекте
          </DialogTitle>
          <DialogActions>
            <Tooltip title="Закрыть окно">
              <IconButton
                onClick={handleClose}
                aria-label="delete"
                size="large"
              >
                <CloseIcon fontSize="inherit" />
              </IconButton>
            </Tooltip>
          </DialogActions>
        </div>

        <DialogContent>
          "Звание: Сержант Фамилия: Карпович Имя: Дмитрий Отчество:
          Константинович Дата рождения: 30.08.1967 Место рождения: Беларусь,
          Минская, Молодечненский, Молодечно, город Место призыва: Беларусь,
          Минская, Молодечненский, Молодечненский РВК Дата гибели: 27.10.1988
          Категория погибшего: Военнослужащий Номер захоронения: 1568 Место
          захоронения: Беларусь, Минская, Молодечненский, Молодечно, город
          Дополнительная информация: погиб в Афганистане Источник информации: По
          данным РИК и РВК""Звание: Сержант Фамилия: Карпович Имя: Дмитрий
          Отчество: Константинович Дата рождения: 30.08.1967 Место рождения:
          Беларусь, Минская, Молодечненский, Молодечно, город Место призыва:
          Беларусь, Минская, Молодечненский, Молодечненский РВК Дата гибели:
          27.10.1988 Категория погибшего: Военнослужащий Номер захоронения: 1568
          Место захоронения: Беларусь, Минская, Молодечненский, Молодечно, город
          Дополнительная информация: погиб в Афганистане Источник информации: По
          данным РИК и РВК""Звание: Сержант Фамилия: Карпович Имя: Дмитрий
          Отчество: Константинович Дата рождения: 30.08.1967 Место рождения:
          Беларусь, Минская, Молодечненский, Молодечно, город Место призыва:
          Беларусь, Минская, Молодечненский, Молодечненский РВК Дата гибели:
          27.10.1988 Категория погибшего: Военнослужащий Номер захоронения: 1568
          Место захоронения: Беларусь, Минская, Молодечненский, Молодечно, город
          Дополнительная информация: погиб в Афганистане Источник информации: По
          данным РИК и РВК""Звание: Сержант Фамилия: Карпович Имя: Дмитрий
          Отчество: Константинович Дата рождения: 30.08.1967 Место рождения:
          Беларусь, Минская, Молодечненский, Молодечно, город Место призыва:
          Беларусь, Минская, Молодечненский, Молодечненский РВК Дата гибели:
          27.10.1988 Категория погибшего: Военнослужащий Номер захоронения: 1568
          Место захоронения: Беларусь, Минская, Молодечненский, Молодечно, город
          Дополнительная информация: погиб в Афганистане Источник информации: По
          данным РИК и РВК""Звание: Сержант Фамилия: Карпович Имя: Дмитрий
          Отчество: Константинович Дата рождения: 30.08.1967 Место рождения:
          Беларусь, Минская, Молодечненский, Молодечно, город Место призыва:
          Беларусь, Минская, Молодечненский, Молодечненский РВК Дата гибели:
          27.10.1988 Категория погибшего: Военнослужащий Номер захоронения: 1568
          Место захоронения: Беларусь, Минская, Молодечненский, Молодечно, город
          Дополнительная информация: погиб в Афганистане Источник информации: По
          данным РИК и РВК""Звание: Сержант Фамилия: Карпович Имя: Дмитрий
          Отчество: Константинович Дата рождения: 30.08.1967 Место рождения:
          Беларусь, Минская, Молодечненский, Молодечно, город Место призыва:
          Беларусь, Минская, Молодечненский, Молодечненский РВК Дата гибели:
          27.10.1988 Категория погибшего: Военнослужащий Номер захоронения: 1568
          Место захоронения: Беларусь, Минская, Молодечненский, Молодечно, город
          Дополнительная информация: погиб в Афганистане Источник информации: По
          данным РИК и РВК"
        </DialogContent>
      </Dialog>
    </React.Fragment>
  );
};
export default ScrollDialog;
