import * as React from "react";
import Button from "@mui/material/Button";
import Dialog from "@mui/material/Dialog";
import DialogActions from "@mui/material/DialogActions";
import DialogContent from "@mui/material/DialogContent";
import DialogTitle from "@mui/material/DialogTitle";
import { useDispatch, useSelector } from "react-redux";
import { AppDispatch, RootState } from "../../../redux/store";
import { setOpenReducer } from "../../../redux/openInfoReducer/openInfoReducer";

export default function ScrollDialog() {
  const openWindow = useSelector((state: RootState) => state.openInfo.data);
  const dispatchStore = useDispatch<AppDispatch>();
  const handleClose = () => dispatchStore(setOpenReducer(false));

  return (
    <React.Fragment>
      <Dialog
        open={openWindow}
        onClose={handleClose}
        aria-labelledby="scroll-dialog-title"
        aria-describedby="scroll-dialog-description"
      >
        <DialogTitle id="scroll-dialog-title">Информация о проекте</DialogTitle>
        <DialogContent>
          "Звание: Сержант Фамилия: Карпович Имя: Дмитрий Отчество:
          Константинович Дата рождения: 30.08.1967 Место рождения: Беларусь,
          Минская, Молодечненский, Молодечно, город Место призыва: Беларусь,
          Минская, Молодечненский, Молодечненский РВК Дата гибели: 27.10.1988
          Категория погибшего: Военнослужащий Номер захоронения: 1568 Место
          захоронения: Беларусь, Минская, Молодечненский, Молодечно, город
          Дополнительная информация: погиб в Афганистане Источник информации: По
          данным РИК и РВК""Звание: Сержант Фамилия: Карпович Имя: Дмитрий
          Отчество: Константинович Дата рождения: 30.08.1967 Место рождения:
          Беларусь, Минская, Молодечненский, Молодечно, город Место призыва:
          Беларусь, Минская, Молодечненский, Молодечненский РВК Дата гибели:
          27.10.1988 Категория погибшего: Военнослужащий Номер захоронения: 1568
          Место захоронения: Беларусь, Минская, Молодечненский, Молодечно, город
          Дополнительная информация: погиб в Афганистане Источник информации: По
          данным РИК и РВК""Звание: Сержант Фамилия: Карпович Имя: Дмитрий
          Отчество: Константинович Дата рождения: 30.08.1967 Место рождения:
          Беларусь, Минская, Молодечненский, Молодечно, город Место призыва:
          Беларусь, Минская, Молодечненский, Молодечненский РВК Дата гибели:
          27.10.1988 Категория погибшего: Военнослужащий Номер захоронения: 1568
          Место захоронения: Беларусь, Минская, Молодечненский, Молодечно, город
          Дополнительная информация: погиб в Афганистане Источник информации: По
          данным РИК и РВК""Звание: Сержант Фамилия: Карпович Имя: Дмитрий
          Отчество: Константинович Дата рождения: 30.08.1967 Место рождения:
          Беларусь, Минская, Молодечненский, Молодечно, город Место призыва:
          Беларусь, Минская, Молодечненский, Молодечненский РВК Дата гибели:
          27.10.1988 Категория погибшего: Военнослужащий Номер захоронения: 1568
          Место захоронения: Беларусь, Минская, Молодечненский, Молодечно, город
          Дополнительная информация: погиб в Афганистане Источник информации: По
          данным РИК и РВК""Звание: Сержант Фамилия: Карпович Имя: Дмитрий
          Отчество: Константинович Дата рождения: 30.08.1967 Место рождения:
          Беларусь, Минская, Молодечненский, Молодечно, город Место призыва:
          Беларусь, Минская, Молодечненский, Молодечненский РВК Дата гибели:
          27.10.1988 Категория погибшего: Военнослужащий Номер захоронения: 1568
          Место захоронения: Беларусь, Минская, Молодечненский, Молодечно, город
          Дополнительная информация: погиб в Афганистане Источник информации: По
          данным РИК и РВК""Звание: Сержант Фамилия: Карпович Имя: Дмитрий
          Отчество: Константинович Дата рождения: 30.08.1967 Место рождения:
          Беларусь, Минская, Молодечненский, Молодечно, город Место призыва:
          Беларусь, Минская, Молодечненский, Молодечненский РВК Дата гибели:
          27.10.1988 Категория погибшего: Военнослужащий Номер захоронения: 1568
          Место захоронения: Беларусь, Минская, Молодечненский, Молодечно, город
          Дополнительная информация: погиб в Афганистане Источник информации: По
          данным РИК и РВК"
        </DialogContent>
        <DialogActions>
          <Button onClick={handleClose}>Закрыть</Button>
        </DialogActions>
      </Dialog>
    </React.Fragment>
  );
}
