import { St } from "./header.style";

const Header = () => {
  return (
    <St.Header>
      <St.Title>Карпович Дмитрий Константинович</St.Title>
      <St.Text>
        Звание: Сержант Фамилия: Карпович Имя: Дмитрий Отчество: Константинович
        Дата рождения: 30.08.1967 Место рождения: Беларусь, Минская,
        Молодечненский, Молодечно, город Место призыва: Беларусь, Минская,
        Молодечненский, Молодечненский РВК Дата гибели: 27.10.1988 Категория
        погибшего: Военнослужащий Номер захоронения: 1568 Место захоронения:
        Беларусь, Минская, Молодечненский, Молодечно, город Дополнительная
        информация: погиб в Афганистане Источник информации: По данным РИК и РВК
      </St.Text>
    </St.Header>
  );
};

export default Header;
