import React from "react";
import { St } from "./text.style";
import { CRITICAL_IMAGES } from "./imagesList";

const History: React.FC = () => {
  return (
    <St.TextBlock>
      <h3>В качестве источников использовались:</h3>
      <St.Text>
        1. Собранная информация при посещении мамы Дмитрия Карповича. Это устный
        рассказ о Дмитрии, фотографии из семейного архива.
      </St.Text>
      <St.Text>
        Были получены подлинные артефакты — личные письма Дмитрия с фронта, его
        детские и армейские фотографии. Эти материалы легли в основу визуального
        оформления проекта и подтвердили факты его боевого пути.
      </St.Text>
      <St.Text>2. Интернет-источники.</St.Text>
      <St.Text>
        3. Исследовательская группа провела работу на базе краеведческого музея
        ГУО «Средняя школа № 14 г. Молодечно».
      </St.Text>
      <St.Text>
        Анализ тематической выставки «Живая память: погибшим
        воинам-интернационалистам», развернутой в учреждении. В музее были
        детально изучены Книги Памяти, личные вещи солдат-земляков, элементы
        военного обмундирования, карты боевых действий и официальные учетные
        карточки. Это позволило сопоставить частную историю Дмитрия с судьбами
        других воинов-молодечненцев.
      </St.Text>
      <St.Figu>
        <St.Img
          $sizeMax={600}
          src={CRITICAL_IMAGES[15]}
          alt="Посещение мамы Дмитрия Карповича участниками проета для сбора информации"
        />
        <St.Figurca>
          Посещение мамы Дмитрия Карповича участниками проета для сбора
          информации. (На снимке: три участницы проекта в домашней обстановке
          вместе с мамой погибшего воина; на переднем плане расположен памятный
          стол с портретами Дмитрия, цветами и архивными материалами).
        </St.Figurca>
      </St.Figu>
      <St.Figu>
        <St.Img
          $sizeMax={600}
          src={CRITICAL_IMAGES[16]}
          alt="Посещение музея в ГУО `Средняя школа № 14 г. Молодечно`"
        />
        <St.Figurca>
          Посещение музея в ГУО `Средняя школа № 14 г. Молодечно` участниками
          проета для сбора информации.(На снимке: участницы проекта на фоне
          музейной экспозиции и стендов «Живая память: погибшим
          воинам-интернационалистам» со списками, письмами и фотографиями
          солдат).
        </St.Figurca>
      </St.Figu>
    </St.TextBlock>
  );
};

export default History;
