import { CRITICAL_IMAGES } from "./imagesList";
import { St } from "./text.style";

const Mail: React.FC = () => {
  return (
    <St.TextBlock>
      <St.Text>Здравствуй Сашка!</St.Text>
      <St.Text>
        Получил твое письмо с фотографиями. Ты на них неплохо получился. Жалко
        только, что школу мало захватило и двор. Но и так было приятно смотреть
        на родные места, на тебя. Высылаю тебе свою фотографию, на которой я и
        Андрей Коваленок. Правда получились мы не важно, но я думаю, что на
        папиных фотографиях мы лучше.
      </St.Text>
      <St.Text>
        Писать о себе нечего, ничего нового не узнал, готовился к экзаменам.
        Наклеек, чтобы тебе прислать, здесь нет. Так что извини. Пиши лучше
        больше о домашних новостях, о школе как идут дела с записями на
        магнитофон. Что-то ничего не слышно о Серёге. Он сейчас учится или как?
        Высылаю тебе еще один рисунок. Но он, правда, тоже только в общих чертах
        похож на мою самоходку. Может когда-нибудь удастся прислать ее
        фотографию. Ну а что там Мишка пишет? Наверное, скоро приедет? На этом
        заканчиваю. Если будет что-нибудь новенькое, расскажу в следующем
        письме. Ну пока.
      </St.Text>
      <St.Text>Дима</St.Text>
      <St.Text>14.10.1986</St.Text>
      <St.Figu>
        <St.Img
          $sizeMax={600}
          src={CRITICAL_IMAGES[18]}
          alt="Письмо от 14.10.1986"
        />
        <St.Figurca>Письмо от 14.10.1986</St.Figurca>
      </St.Figu>
      <St.Text>Привет Сашка!</St.Text>
      <St.Text>
        Как ты там живешь без меня? Скоро у тебя каникулы. Не забывай писать мне
        почаще я-то тебе уже не смогу так часто писать. Как у тебя дела в школе,
        как закончил 2-ю четверть? Сколько новых игрушек купил. Выпал ли снег и
        катаешься ли на лыжах? Видишь сколько вопросов, так что пиши и отвечай
        на них. Помнишь, ты писал, что трудно будет запомнить новый мой адрес. А
        что теперь скажешь? Скоро Новый год. Как там папа собирается ставить
        елку? Если да, то попроси сфотографироваться всех и пришли мне
        фотографию.
      </St.Text>
      <St.Text>
        У Вани Маленького скоро экзамены. Ты попроси его написать мне, а то у
        меня не часто найдется время написать ему. И Тане скажи. Здесь конфеты
        продаются очень вкусные. Когда буду ехать домой куплю, наверное, целый
        чемодан. Ну а природа здесь так себе. Когда-нибудь пришлю фотографию,
        увидишь. Как там мама с папой скучают по мне, часто меня вспоминаете? Я
        так вас часто. Домой по-прежнему хочется. Хотя время здесь быстрее
        бежит, чем в Мулино. Да, я забыл написать маме с папой, что жить мы
        будем на точке всю зиму, и им письма отсылать трудно. Только тогда
        отправляем, когда кто-то едет в полк. Ну, я думаю это письмо они тоже
        будут читать, так что можешь им передать. На этом заканчиваю. Поздравляю
        с новым 1987 годом. Желаю стать отличником в новом году.
      </St.Text>
      <St.Text>До свидания </St.Text> <St.Text>Дима</St.Text>
      <St.Figu>
        <St.Img
          $sizeMax={600}
          src={CRITICAL_IMAGES[19]}
          alt="Письмо конца 1986 года"
        />
        <St.Figurca>Письмо конца 1986 года</St.Figurca>
      </St.Figu>
      <St.Text>Здравствуйте родные папа мама Сашка, дед</St.Text>
      <St.Text>
        Видно, я неисправим — не могу часто писать. Просто не нахожу темы. Вчера
        получил от мамы письмо. Ты, мамочка, опять напоминаешь, что я редко
        пишу, но что я могу с собой поделать. И вот опять же о чем писать.
      </St.Text>
      <St.Text>
        О том, что у меня все отлично и здоровье мое в порядке? Так в этом
        можете не сомневаться. На новой работе я начал толстеть. Видели бы вы
        мои щеки. А чтобы сохранить форму приходится иногда пропускать ужин. В
        обед ешь только первое. Кормят отлично. Было у нас 3 барана (отбились от
        стада) недавно съели последнего. Узбеки сделали плов — пальчики
        оближешь. Я попробую научится так делать. И вот от такой резкой перемены
        пищи (по сравнению с учебной) у меня в начале было небольшое
        расстройство желудка.
      </St.Text>
      <St.Text>
        Ну вот, о чем бы еще написать? Что новенького у Сашки, Вали с Оксаной
        письмо я пока не получал. Так что пишите по новой.
      </St.Text>
      <St.Text>
        От папы открытку я тоже не получил. Так что делайте выводы. Ну, вот и
        все мысли исчерпаны. Я заканчиваю. Если что придумаю новенькое — напишу
        в следующем письме. А вы не забывайте обо мне. Я тоже жду писем. На
        этом, до свидания.
      </St.Text>
      <St.Text>Дима</St.Text>
      <St.Text> 23.07.1987</St.Text>
      <St.Text></St.Text>
      <St.Text></St.Text>
      <St.Text></St.Text>
      <St.Text></St.Text>
      <St.Text></St.Text>
      <St.Text></St.Text>
      <St.Text></St.Text>
      <St.Text></St.Text>
      <St.Text></St.Text>
      <St.Text></St.Text>
      <St.Text></St.Text>
      <St.Text></St.Text>
      <St.Text></St.Text>
      <St.Text></St.Text>
      <St.Text></St.Text>
      <St.Figu>
        <St.Img
          $sizeMax={600}
          src={CRITICAL_IMAGES[17]}
          alt="Письмо от 23.07.1987"
        />
        <St.Figurca>Письмо от 23.07.1987</St.Figurca>
      </St.Figu>
    </St.TextBlock>
  );
};

export default Mail;
