import React from "react";
import { St } from "./text.style";
import { CRITICAL_IMAGES } from "./imagesList";

const Memory: React.FC = () => {
  return (
    <St.TextBlock>
      <h3>Где и как увековечена память:</h3>
      <St.Text>
        Музей ГУО «Средняя школа № 14 г. Молодечно» — здесь оформлена
        мемориальная экспозиция. В музее хранятся фотографии Дмитрия Карповича,
        его награды (включая медаль «За отвагу»), а также архивные материалы и
        снимки, посвященные землякам-афканцам.
      </St.Text>
      <St.Figu>
        <St.Img
          $sizeMax={800}
          src={CRITICAL_IMAGES[12]}
          alt="Фотография Дмитрия Карповича. По центру (Находится в музее ГУО
          `СРЕДНЯЯ ШКОЛА № 14 Г. МОЛОДЕЧНО`)"
        />
        <St.Figurca>
          Фотография Дмитрия Карповича. По центру (Находится в музее ГУО
          `СРЕДНЯЯ ШКОЛА № 14 Г. МОЛОДЕЧНО`)
        </St.Figurca>
      </St.Figu>
      <St.Figu>
        <St.Img
          $sizeMax={800}
          src={CRITICAL_IMAGES[11]}
          alt="Награда Дмитрия Карповича. Обведена белым. (Находится в музее ГУО `СРЕДНЯЯ ШКОЛА № 14 Г. МОЛОДЕЧНО`)"
        />
        <St.Figurca>
          Награда Дмитрия Карповича. Обведена белым. (Находится в музее ГУО
          `СРЕДНЯЯ ШКОЛА № 14 Г. МОЛОДЕЧНО`)
        </St.Figurca>
      </St.Figu>
      <St.Text>
        Вход в ГУО «Гимназия № 10 г. Молодечно» — на здании установлена памятная
        мемориальная доска с портретом героя, напоминающая о годах его учебы в
        этой школе (1974–1984 гг.).
      </St.Text>
      <St.Text>
        Пионерская дружина СШ № 10 — носит имя Дмитрия Константиновича
        Карповича, продолжая традиции патриотического воспитания молодежи.
      </St.Text>

      <St.Figu>
        <St.Img
          $sizeMax={500}
          src={CRITICAL_IMAGES[13]}
          alt="Мемориальная доска в честь Дмитрия Карповича. (Находится на входе ГУО Гимназии
          №10 г. Молодечно"
        />
        <St.Figurca>
          Мемориальная доска в честь Дмитрия Карповича. (Находится на входе ГУО
          "Гимназии №10 г. Молодечно")
        </St.Figurca>
      </St.Figu>
    </St.TextBlock>
  );
};

export default Memory;
