import React from "react";
import { St } from "./text.style";
import IMG1 from "../img/2fsg.jpg";
import IMG2 from "../img/sdbsd.jpg";
import IMG3 from "../img/dsbfdngfh6.jpg";
import { CRITICAL_IMAGES } from "./imagesList";

const Pinfo: React.FC = () => {
  return (
    <St.TextBlock>
      <St.Text>
        Дмитрий Константинович Карпович родился 30 августа 1967 года в Молодечно
        (Минская область). Состоял в ВЛКСМ.
      </St.Text>
      <St.Text>
        Его мама, Леонарда Ивановна, работала контролёром на
        учебно-производственном предприятии Белорусского общества слепых. Отец,
        Константин Иванович, был инвалидом-пенсионером.
      </St.Text>
      <St.Text>
        Дима рос творческим и увлеченным парнем. В родном Молодечно он окончил
        школу № 10, а в 1984 году поехал покорять Минск — поступил на
        строительный факультет Белорусского политехнического института. У него
        был редкий талант и золотые руки: свободное время он посвящал созданию
        невероятно точных, тонких и живых архитектурных моделей, которые
        мастерил вручную.
      </St.Text>
      <St.Figu>
        <St.Img
          $sizeMax={400}
          src={IMG1}
          alt="Дмитрий окончил среднюю школу № 10 в Молодечно. 1984 год"
        />
        <St.Figurca>
          Дмитрий окончил среднюю школу № 10 в Молодечно. 1984 год
        </St.Figurca>
      </St.Figu>
      <St.Figu>
        <St.Img
          $sizeMax={400}
          src={CRITICAL_IMAGES[10]}
          alt="Архитектурные модели Дмитрия. Ручная работа"
        />
        <St.Figurca>Архитектурные модели Дмитрия. Ручная работа</St.Figurca>
      </St.Figu>
      <St.Text>
        Осенью 1986 года был призван в ряды Советской Армии Советским районным
        военным комиссариатом города Минска.
      </St.Text>
      <St.Text>
        Больше всего на свете Дима любил свою маму и отчаянно пытался уберечь её
        от страшной правды. Уже зная, что его отправляют на войну, он не сказал
        ей правды, чтобы не волновать: сказал, что едет служить в спокойное
        Забайкалье. И потом, из афганского пекла, он отправлял домой полные
        тепла письма с приветами из выдуманной «солнечной Монголии». Он писал
        коротко, просто и спокойно: что светит солнце, что он жив и здоров, а
        вокруг — «ну, как обычно — просто служба».
      </St.Text>
      <St.Figu>
        <St.Img $sizeMax={400} src={IMG3} alt="Служба в Афганистане" />
        <St.Figurca>Служба в Афганистане</St.Figurca>
      </St.Figu>
      <St.Figu>
        <St.Img src={IMG2} alt="Служба в Афганистане" />
        <St.Figurca>Служба в Афганистане</St.Figurca>
      </St.Figu>
      <St.Text>
        В марте 1988 года во время выполнения боевого задания сержант Карпович
        совершил свой главный подвиг, но получил тяжелейшее ранение ноги. Рана
        спровоцировала развитие смертельной болезни — саркомы (рака кости).
        Дальше были долгие месяцы борьбы в госпиталях Афганистана, Ташкента и
        знаменитой московской «Бурденко». Даже на больничной койке, опираясь на
        костыли, Дима старался улыбаться.
      </St.Text>
      <St.Figu>
        <St.Img $sizeMax={400} src={CRITICAL_IMAGES[5]} alt="В госпитале" />
        <St.Figurca>В госпитале</St.Figurca>
      </St.Figu>
      <St.Figu>
        <St.Img $sizeMax={400} src={CRITICAL_IMAGES[7]} alt="В госпитале" />
        <St.Figurca>В госпитале</St.Figurca>
      </St.Figu>
      <St.Text>Скончался 27 октября 1988 года. Похоронен в Молодечно.</St.Text>
      <St.Text>
        За свое мужество он был посмертно награжден медалью
        «Воину-интернационалисту от благодарного афганского народа». Он ушел
        слишком рано, но оставил после себя память как о человеке огромной
        храбрости, невероятного таланта и бесконечной сыновней любви.
      </St.Text>
    </St.TextBlock>
  );
};

export default Pinfo;
