import React from "react";

const Pinfo: React.FC = () => {
  return (
    <div>
      <p>
        Дмитрий Константинович Карпович Родился 30 августа 1967 года в городе
        Молодечно Минской области. Белорус. Член ВЛКСМ. Мать, Леонарда Ивановна,
        работала контролером на учебно-производственном предприятии Белорусского
        общества слепых; отец, Константин Иванович, был инвалидом-пенсионером. В
        1984 году Дмитрий окончил среднюю школу № 10 в Молодечно. Поступил на
        строительный факультет Белорусского политехнического института, где
        проучился два курса. Осенью 1986 года был призван в ряды Советской Армии
        Советским районным военным комиссариатом города Минска. Проходил службу
        в Афганистане. В марте 1988 года при выполнении боевого задания сержант
        Д. К. Карпович получил тяжелое ранение ноги, которое впоследствии
        привело к развитию саркомы (рака кости). Проходил лечение в госпиталях в
        Афганистане, Ташкенте и Москве (в госпитале имени Н. Н. Бурденко).
        Скончался 27 октября 1988 года. Похоронен в Молодечно. Награжден медалью
        «Воину-интернационалисту от благодарного афганского народа». Он уже
        знал, что его отправляют в Афганистан, но, чтобы не волновать мать,
        сказал ей, что его направляют в Забайкалье. Во всех своих письмах он
        передавал приветы из «солнечной Монголии». Письма были спокойными и
        краткими: писал, что светит солнце, что он жив-здоров, а служба идет...
        ну, как обычно — просто служба.
      </p>
    </div>
  );
};

export default Pinfo;
