import React from "react";
import { St } from "./text.style";
import IMG1 from "../img/2fsg.jpg";
import IMG2 from "../img/sdbsd.jpg";
import IMG3 from "../img/dsbfdngfh6.jpg";

const Pinfo: React.FC = () => {
  return (
    <St.TextBlock>
      <St.Text>
        Дмитрий Константинович Карпович родился 30 августа 1967 года в Молодечно
        (Минская область). Состоял в ВЛКСМ.
      </St.Text>
      <St.Text>
        Его мама, Леонарда Ивановна, работала контролёром на
        учебно-производственном предприятии Белорусского общества слепых. Отец,
        Константин Иванович, был инвалидом-пенсионером.
      </St.Text>
      <St.Text>
        В 1984 году Дмитрий окончил среднюю школу № 10 в Молодечно и поступил на
        строительный факультет Белорусского политехнического института, где
        отучился два курса.
      </St.Text>
      <St.Figu>
        <St.Img
          src={IMG1}
          alt="Дмитрий окончил среднюю школу № 10 в Молодечно. 1984 год"
        />
        <St.Figurca>
          Дмитрий окончил среднюю школу № 10 в Молодечно. 1984 год
        </St.Figurca>
      </St.Figu>
      <St.Text>
        Осенью 1986 года был призван в ряды Советской Армии Советским районным
        военным комиссариатом города Минска.
      </St.Text>
      <St.Text>Проходил службу в Афганистане.</St.Text>
      <St.Figu>
        <St.Img src={IMG3} alt="Служба в Афганистане" />
        <St.Figurca>Служба в Афганистане</St.Figurca>
      </St.Figu>
      <St.Text>
        В марте 1988 года при выполнении боевого задания сержант Д. К. Карпович
        получил тяжелое ранение ноги, которое впоследствии привело к развитию
        саркомы (рака кости). Проходил лечение в госпиталях в Афганистане,
        Ташкенте и Москве (в госпитале имени Н. Н. Бурденко).
      </St.Text>
      <St.Figu>
        <St.Img src={IMG2} alt="Служба в Афганистане" />
        <St.Figurca>Служба в Афганистане</St.Figurca>
      </St.Figu>
      <St.Text>Скончался 27 октября 1988 года. Похоронен в Молодечно.</St.Text>
      <St.Text>
        Награжден медалью «Воину-интернационалисту от благодарного афганского
        народа». Он уже знал, что его отправляют в Афганистан, но, чтобы не
        волновать мать, сказал ей, что его направляют в Забайкалье. Во всех
        своих письмах он передавал приветы из «солнечной Монголии». Письма были
        спокойными и краткими: писал, что светит солнце, что он жив-здоров, а
        служба идет... ну, как обычно — просто служба.
      </St.Text>
    </St.TextBlock>
  );
};

export default Pinfo;
