import { CRITICAL_IMAGES } from "./imagesList";
import { St } from "./text.style";

const School: React.FC = () => {
  return (
    <St.TextBlock>
      <St.Text>
        Интерактивный плакат, созданный на основе архивных документов, писем и
        фотографий Дмитрия Карповича, — это универсальный цифровой ресурс.
        Благодаря удобному формату (сочетанию визуального ряда, документов и
        хроники) его можно использовать в самых разных направлениях
        образовательной, музейной и воспитательной работы.
      </St.Text>
      <h2>Вот основные сферы и варианты применения такого плаката:</h2>
      <h3>1. В учебном процессе </h3>
      <St.Text>
        • Уроки истории: При изучении тем, связанных с геополитикой СССР во
        второй половине XX века, Афганской войной (1979–1989 гг.) и локальными
        конфликтами. Плакат помогает уйти от сухих цифр к «живой истории» одного
        человека.
      </St.Text>
      <St.Text>
        • Уроки обществоведения: При разборе тем «Патриотизм», «Гражданский
        долг», «Мужество» и «Ценность человеческой жизни».
      </St.Text>
      <St.Text>
        • Уроки информатики и медиаграмотности: Как эталонный пример проектной
        деятельности учащихся. На его базе можно показать, как собирать,
        структурировать, оцифровывать и интерактивно представлять архивные
        материалы.
      </St.Text>
      <h3>2. В воспитательной и внеклассной работе </h3>
      <St.Text>
        • Информационные и классные часы: Проведение тематических занятий к
        важным датам: 15 февраля (День памяти воинов-интернационалистов) или 23
        февраля (День защитников Отечества).
      </St.Text>
      <St.Text>
        • Уроки мужества и диалоговые площадки: Как визуальная основа для встреч
        школьников с ветеранами-афганцами, представителями союзов ветеранов или
        курсантами.
      </St.Text>
      <St.Text>
        • Презентация на школьных линейках и лекториях: Демонстрация материалов
        на большом экране перед общешкольными памятными мероприятиями.
      </St.Text>
      <h2>Примерный-план информационного часа</h2>
      <St.Text>
        <b>Цель урока:</b> Воспитание гражданско-патриотических качеств
        школьников на примере исторического события и судьбы земляка —
        воина-интернационалиста сержанта Дмитрия Карповича.
      </St.Text>
      <St.Text>
        <b>Оборудование:</b> Компьютер, проектор или интерактивная панель с
        открытым интерактивным плакатом «Памяти Дмитрия Карповича».
      </St.Text>
      <h3>Ход занятия</h3>
      <St.Text>
        <b>I. Вводная часть: Память о войне</b>
      </St.Text>
      <St.Text>
        • Слово учителя: На базе традиционного вступления. Учитель напоминает,
        что в Республике Беларусь 15 февраля отмечается День памяти
        воинов-интернационалистов. В этот день в 1989 году завершился вывод
        советских войск из Афганистана. Война длилась 9 лет 1 месяц и 18 дней.
      </St.Text>
      <St.Text>
        • Постановка проблемы: Сегодня мы посмотрим на эту войну не только через
        призму сухих цифр учебника, а через реальную историю нашего земляка,
        обычного парня, который учился в средней школе № 14 г. Молодечно —
        сержанта Дмитрия Карповича.
      </St.Text>
      <St.Text>
        <b>II. Основная часть. Работа с интерактивным плакатом</b>
      </St.Text>
      <St.Text>
        <b>Блок 1. Географическая и историческая справка</b>
      </St.Text>
      <St.Text>
        • Работа с плакатом: Учитель открывает вкладку «Информация о войне» на
        плакате.
      </St.Text>
      <St.Text>
        • Сообщение учащихся / Учителя: Краткий обзор геополитической ситуации
        начала 1970–1979 гг. (разрядка, ввод Ограниченного контингента 25
        декабря 1979 года, штурм дворца Тадж-Бек группами «Зенит» и «Гром»).
      </St.Text>
      <St.Text>
        • Интерактивный опрос: Что представлял собой Афганистан? (Территория —
        647,5 тыс. кв. км, столица — Кабул, господствующая религия — ислам).
      </St.Text>
      <St.Text>
        <b>Блок 2. Судьба сержанта: от школьной скамьи до Афганистана</b>
      </St.Text>
      <St.Text>
        • Работа с плакатом: Учитель переходит в раздел «Биографическая
        информация» Дмитрия Карповича.
      </St.Text>
      <St.Text>
        • Рассказ с опорой на визуал плаката: Дмитрий родился 30 августа 1967
        года в Молодечно. Учился в школе № 14. Обратить внимание учащихся на
        уникальный экспонат на плакате — фотографию макета деревянного дома,
        сделанного руками Димы. У него был редкий талант и золотые руки
        (мастерил точные архитектурные модели). Осенью 1985 года был призван в
        ряды Советской Армии.
      </St.Text>
      <St.Text>
        • Акцент на человеческие качества: Учитель зачитывает воспоминания мамы
        о том, как Дима оберегал её от страшной правды: уезжая, сказал, что едет
        служить в спокойное место — в степи Забайкалья.
      </St.Text>
      <St.Figu>
        <St.Img
          $sizeMax={500}
          src={CRITICAL_IMAGES[20]}
          alt="Урок с использованием интерактивного плаката"
        />
        <St.Figurca>Урок с использованием интерактивного плаката</St.Figurca>
      </St.Figu>
    </St.TextBlock>
  );
};

export default School;
