import React from "react";
import { St } from "./text.style";
import SHTURM from "../img/shturm.jpg";
import SHTURM1 from "../img/Afgan1987_Gardez_UAZ469.jpg";
import SHTURM2 from "../img/October_87_-_Khalis-loyal_Muja.jpg";
import SHTURM3 from "../img/RIAN_archive_58833_Withdrawal_of_Soviet_troops_from_Afghanistan.jpg";
import SHTURM4 from "../img/Evstafiev-spetsnaz-prepare-for-mission.jpg";
import ReactPlayer from "react-player";

const War: React.FC = () => {
  return (
    <St.TextBlock>
      <St.Text>
        Начало 1970-х гг. было ознаменовано процессом разрядки международной
        напряженности.
      </St.Text>
      <St.Text>
        В1970г. был подписан советско-западногерманский договор. Обе стороны
        признавали послевоенные границы в Европе иотказывались от применения
        силы. Вмае 1972г. состоялся визит президента США Р.Никсона в СССР. Входе
        визита между СССР и США были подписаны договоры об основах
        взаимоотношений двух стран, об ограничении вооружений. Входе визита
        Л.И.Брежнева в США в 1973г. состоялось подписание соглашения
        опредотвращении ядерной войны. Важным событием стало Совещание по
        безопасности исотрудничеству в Европе (1975).
      </St.Text>
      <St.Text>
        Разрядка была сорвана после того, как на Западе началась кампания
        вподдержку прав человека в СССР, а Советский Союз ввел свои войска в
        Афганистан вдекабре 1979г.<i>[1, c.185]</i>.
      </St.Text>

      <St.Text>
        Решение о вводе советских войск в Афганистан было принято 12 декабря
        1979 года на заседании Политбюро ЦК КПСС. Решение принимали долго и
        трудно. Целый год высшее руководство Советского Союза колебалось:
        вводить войска, не вводить. Министерство обороны СССР было против
        отправки наших солдат за границы страны. Но в декабре 1979 года
        Советскую 40-ю армию все-таки послали выполнять задачи за южную границу
        нашей страны. Официальной целью было предотвращение угрозы иностранного
        военного вмешательства. В качестве формального основания Политбюро ЦК
        КПСС использовало неоднократные просьбы руководства соседней страны.
      </St.Text>
      <St.Figu>
        <St.Img
          src={SHTURM}
          alt="Дворец Тадж-Бек со стороны правого крыла после штурма"
        />
        <St.Figurca>
          Дворец Тадж-Бек со стороны правого крыла после штурма (27 декабря 1979
          года)
        </St.Figurca>
      </St.Figu>
      <St.Text>
        Участие советских войск в боевых действиях в Афганистане не
        предусматривалось, даже не был определен порядок применения оружия
        нашими солдатами в целях самообороны. В директиве № 312/12/001 министра
        обороны СССР говорилось, что целью ввода наших войск является «оказание
        помощи дружественному афганскому народу, а также создание благоприятных
        условий для воспрещения возможных антиафганских акций со стороны
        сопредельных государств». Но очень скоро Ограниченный контингент
        советских войск (ОКСВ) оказался непосредственно втянут в разгоравшуюся в
        Афганистане гражданскую войну.
      </St.Text>
      <St.Figu>
        <St.Img
          src={SHTURM1}
          alt="Солдаты десантно-штурмовой бригады, дислоцировавшейся в Гардезе"
        />
        <St.Figurca>
          Солдаты десантно-штурмовой бригады, дислоцировавшейся в Гардезе
        </St.Figurca>
      </St.Figu>
      <St.Text>
        Первыми 25 декабря 1979 года в Афганистан вошли, а вышли последними 15
        февраля 1989 года, бойцы 103-й Витебской дивизии Воздушно-десантных
        войск СССР. Первой боевой задачей, поставленной перед 103-й ВДД, стала
        операция «Байкал-79» по захвату важных объектов в Кабуле. Планом
        операции предусматривался захват 17 важнейших объектов в афганской
        столице. Среди них - здания министерств, штабов, тюрьма для
        политзаключенных, радиоцентр и телецентр, почта и телеграф. Все это было
        выполнено безукоризненно. Одновременно десантники из Витебска
        заблокировали располагавшиеся в афганской столице штабы, воинские части
        и соединения вооруженных сил Афганистана.
      </St.Text>
      <St.Text>
        Затем, на протяжении всего срока пребывания в Афганистане, 103-я ВДД
        принимала активное участие в различных по масштабу войсковых операциях.
        Более 11 тысяч воинов этого прославленного соединения были награждены
        орденами и медалями, 16 гвардейцев стали Героями Советского Союза. За
        успешное выполнение поставленных боевых задач соединение было награждено
        орденом Ленина.
      </St.Text>
      <St.Text>
        При поддержке государств Запада и консервативных мусульманских режимов
        Ближнего Востока силы афганской вооруженной оппозиции росли от года к
        году. Общая численность ее отрядов в различные периоды войны составляла
        от 47 до 173 тысяч человек. Хорошо вооруженные, обученные иностранными
        инструкторами, получающие солидную оплату за удачные операции против
        шурави (советских), эти моджахеды стали серьезным врагом для советских
        солдат.
      </St.Text>
      <St.Figu>
        <St.Img
          src={SHTURM2}
          alt="Моджахеды Исламской Партии Афганистана, 1987 год"
        />
        <St.Figurca>
          Моджахеды Исламской Партии Афганистана, 1987 год
        </St.Figurca>
      </St.Figu>
      <St.Text>
        Но и наши бойцы и командиры сражались славно. Численность группировки
        советских войск в различные годы составляла от 81 800 до 108 000
        человек. Конечно, не все из военнослужащих участвовали непосредственно в
        боевых действиях. На ОКСВ было возложено выполнение многих задач: от
        охраны народно-хозяйственных объектов и автомобильных дорог до прикрытия
        границ Афганистана с Пакистаном и Ираном от проникновения караванов с
        оружием. Но все-таки главным содержанием пребывания советских войск в
        этой стране стали бои с душманами (врагами).
      </St.Text>
      <St.Figu>
        <St.Img
          src={SHTURM4}
          alt="Советская группа Специального назначения готовится к выходу на задание. Афганистан, 1988"
        />
        <St.Figurca>
          Советская группа Специального назначения готовится к выходу на
          задание. Афганистан, 1988
        </St.Figurca>
      </St.Figu>
      <St.Text>
        В 1980 - 1988 годах соединения и части 40-й армии в Афганистане почти
        непрерывно вели активные боевые действия, и вели их успешно. В Герате и
        Кундузе, Джелалабаде и Газни, Кандагаре и Пактии, Бамиане и Панджшерском
        ущелье - везде, где в дело вступала наша регулярная армия, она
        одерживала победы.
      </St.Text>
      <St.Text>
        Последний командующий советской 40-й армией генерал-полковник Борис
        Громов написал в мемуарах: «Я глубоко убежден: не существует оснований
        для утверждения о том, что 40-я армия потерпела поражение, равно как и о
        том, что мы одержали военную победу в Афганистане. Советские войска в
        конце 1979 года беспрепятственно вошли в страну, выполнили - в отличие
        от американцев во Вьетнаме - свои задачи и организованно вернулись на
        Родину. Если в качестве основного противника Ограниченного контингента
        рассматривать вооруженные отряды оппозиции, то различие между нами
        заключается в том, что 40-я армия делала то, что считала нужным, а
        душманы - лишь то, что могли».<i>[2]</i>.
      </St.Text>
      <div style={{ width: "100%", maxWidth: "600px", aspectRatio: "16/9" }}>
        <ReactPlayer
          controls={true}
          style={{
            width: "100%",
            height: "100%",
          }}
          src="https://www.youtube.com/watch?v=cU8cXyVE0Ig" // <--- THIS IS THE PROBLEM
        />
      </div>
      <St.Figu>
        <St.Img
          $sizeMax={400}
          src={SHTURM3}
          alt="Последняя колонна советских войск из Афганистана пересекает границу СССР. 1989"
        />
        <St.Figurca>
          Последняя колонна советских войск из Афганистана пересекает границу
          СССР. 1989
        </St.Figurca>
      </St.Figu>
    </St.TextBlock>
  );
};

export default War;
